Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisSurfaceOriginX Property

---

"Origin (X)"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisSurfaceOriginX { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisSurfaceOriginX As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisSurfaceOriginX {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisSurfaceOriginX : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace